stu = {"学号":2018123, "姓名":"小莫", "班级":"软件184", "年龄":18}
stu1 = {"学号":2018124, "姓名":"小能", "班级":"软件183", "年龄":19}
stu2 = {"学号":2018125, "姓名":"小羊", "班级":"软件184", "年龄":17}
stu3 = {"学号":2018126, "姓名":"小马", "班级":"软件181", "年龄":16}
stu4 = {"学号":2018127, "姓名":"小鲨", "班级":"软件181", "年龄":20}

list = []


for i in range(5):
    for j in range(4):
        student = {}
        msg = ["学号", "姓名", "班级", "年龄"]
        str = input("输入"+msg[j])
        student[msg[j]] = str
        list.append(student)
    # str1 = input("输入学号")
    # str2 = input("输入姓名")
    # str3 = input("输入班级")
    # str4 = input("输入年龄")
    # list.append({"学号":str1, "姓名":str2, "班级":str3, "年龄":str4})
    print(list)

